/*****************************************************************************
 * PROJECT NAME   : 올레마켓 웹툰
 * SUBSYSTEM NAME : 사용자
 * FILE NAME      : StringUtil.java
 * DESCRIPTION    : 문자열 관련 Util class.
 * 
 * VERSION NO     author           date        content  -> info
 * ----------------------------------------------------------------------------
      1.0        InJae Yeo      2014-04-15      init
 *****************************************************************************/

package com.olleh.webtoon.common.util;

import org.apache.commons.logging.Log;
import org.apache.commons.logging.LogFactory;

public class SpamWordUtil {
	
	protected static Log logger = LogFactory.getLog(SpamWordUtil.class);

	protected static String[] CONTAIN_SPAM_WORDS = {
		"69", "588", "1090tv", "10jil", "18tv", "18x", "19금", "19동영상", "19성인", "19세", "4kkasi", "asiangirl", "Avmania", "AV매니아", "AV배우", "bbagoori", "bbagury",
		"bdsm", "beheading", "boG", "bogy", "boji", "bojy", "bozi", "bozy", "bo지", "bo지", "bubunara", "bunsec", "bunsek", "byuntae", "byuntae", "c2joy",
		"c8", "condom", "c발", "c발", "c벨", "c퐐", "dhakeka", "diehd", "dildo", "dnjswhrywp", "ecstasy", "femdom", "fetish", "fuck", "gangbang", "gocinepia",
		"g-spot", "g스팟", "hentai", "hotsex", "jaG", "jagy", "jaji", "jajy", "jamG", "jamgy", "jamji", "jamjy", "jamzi", "jamzy", "jam지", "jazi", "jazy",
		"ja지", "kgirls", "MC무현", "molca", "nude", "ogrish", "olleh마켓", "oral", "penis", "penthouse", "petish", "ponsec", "ponsek", "porn", "porner",
		"porno", "prno", "qkenrdl", "rotten", "sex", "sora", "suck", "swaping", "tprtm", "yadong", "yasa", "yasul", "zaG", "zagy", "zaji", "zajy", "zamG",
		"zamgy", "zamjy", "zamzi", "zamzy", "zam쥐", "zazi", "zazy", "za지", "zotto", "가슴구경", "가슴나오", "가슴노모", "가슴만", "가슴보", "가슴빠", "가슴빨", "가슴사",
		"가슴을", "가슴주물럭", "가슴짱", "가슴큰", "가슴훔", "가정교사미키", "간철수", "갈보", "감청", "강간", "강쇠", "개간녀", "개년", "거유", "겁탈", "고객샌", "고객센", "고무통", "고추만",
		"고추짱", "과부촌", "구녕", "국물", "귀두", "그룹섹", "근친", "글래머", "김머중", "까보전", "꺼져", "껒여", "꼬추", "꼴려", "꼴림", "꽃뱀", "나가요", "나랑께", "나체", "낙태", "난교",
		"넣어줘", "네다통", "네다홍", "노고무통", "노고무현", "노노무라", "노로스", "노미넴", "노부엉", "노브라", "노슨상", "노시계", "노알라", "노예", "노오란", "노오랗다", "노운지", "노짱",
		"노출", "노팬츠", "놈현", "누두", "누드", "누룩만화", "누룩미디어", "누룩운영자", "누룩코믹스", "니미랄", "니미럴", "다방레지", "닥그네", "단란주점", "닭그네", "대딸", "대마초",
		"대줄년", "대줄뇬", "대출", "대포차", "대포통장", "대포폰", "도요타다이쥬", "도요타다이쥬", "도청", "도촬", "돌림빵", "동거", "동물섹", "뒤치기", "뒷치기", "딜도", "따먹기",
		"따먹어", "따무라", "딸달이", "딸따뤼", "딸따리", "딸딸2", "딸딸이", "떡걸", "떡치기", "떼십", "또라이", "띠벌", "러브젤", "러브호텔", "레비트라", "레이싱걸", "레즈비언", "로리타",
		"로린", "롤리타", "룸사롱", "룸살롱", "룸싸롱", "룸쌀롱", "ㅁㅈㅎ", "마스터배이션", "마약", "망가", "망까", "맞고", "매춘", "맹바기", "맹박이", "멍청도", "명바기", "명박이", "모르핀",
		"몰핀", "몸챗", "몸캠", "무료성인", "무삭제", "무슨상관", "문죄인", "물뽕", "미시촌", "미쎄스터", "미씨촌", "미친", "민주화", "바구리", "바이브레이터", "박그네", "박원숭", "발기",
		"발정", "밤일", "밥노스", "방석집", "배드신", "배드신", "버서", "버짓물", "번색", "번섹", "번쌕", "벌려", "벗기기", "벗기는", "벗어", "벗은", "벙섹", "베드신", "베충", "베츙", "변녀",
		"변섹", "변태", "변테", "병신", "보G", "보gy", "보jy", "보z", "보zi", "보zy", "보꾸기", "보도방", "보빨", "보슬아치", "보쥐", "보지", "보질리아", "보짓", "보짖", "보테크", "보혐", "본디지",
		"봉지털", "부가케", "부랄", "부엉이바위", "불륜", "불알", "붕가", "붕알", "븅신", "비아그라", "빙신", "빠걸", "빠구", "빠굴", "빠꾸리", "빠라", "빠순이", "빡우리", "빡울", "빡촌", "빨간마후라",
		"빨갱이", "빨기", "빨아", "빨어", "빨통", "뻐르너", "뻐르노", "뻐킹", "뽀로노", "뽀르노", "뽀지", "뽈노", "뽈로노", "사까쉬", "사까시", "사까치", "사창가", "사카시", "삼일한", "삼일한",
		"삽입", "삿깟시", "새꺄", "새끼", "색골", "색남", "색녀", "색마", "색수", "색쉬", "색스", "색쓰", "색폰", "색휘", "생식기", "설라디언", "성감대", "성관계", "성교", "성기구", "성드립",
		"성매매", "성생활", "성전환", "성클리닉", "성태크닉", "성테크닉", "성폭행", "성행위", "세꺄", "세엑스", "섹s", "섹걸", "섹골", "섹녀", "섹도리", "섹도우즈", "섹마", "섹소녀", "섹소리", "섹수", 
		"섹순", "섹쉬", "섹슈얼", "섹스", "섹쑤", "섹쓰", "섹잘하는", "섹티즌", "섹파", "섹하고", "섹할", "섹휘", "소라가이드", "소라넷", "소라의가이드", "속옷", "쇼걸", "수간", "수꼴", "수음",
		"수타킹", "쉑스", "스너프", "스리섬", "스리썸", "스아핑", "스와핑", "스왑", "스쿨걸", "스타킹", "스트립", "스팽킹", "슨상님", "슨탄절", "슴가", "시알리스", "시팔", "신음", "신장매매", "신장밀매",
		"신장판매", "십jil", "쌍놈", "쌍도", "쌕걸", "쌕녀", "쌕쉬", "쌕스", "쌕시", "쌕쓰", "쌩쇼", "쌩쑈", "쎄끈", "쎄엑스", "쎅", "쓰리섬", "쓰리썸", "씨bal", "씨바", "씨발", "씨알리스", "씹",
		"씹하", "ㅇㅂ", "아마텐", "아마텐", "아색기가", "아오이소라", "아편", "안마시술", "알몸", "애널", "애로", "애무", "애액", "애인교환", "애인대여", "애인대행", "애인방", "애인브레이져",
		"애인알바", "애자매", "애플리케이션", "야게임", "야겜", "야근병동", "야기분좋", "야께임", "야껨", "야덩", "야동", "어덜트", "엑스타스", "엑스터시", "엑스터시", "오그리쉬", "오그리시",
		"오나니", "오랄", "오럴", "오르가", "오입", "올레닷컴", "올레마켓", "요힘빈", "용주골", "우덜란드", "유두", "육구자세", "육봉", "윤간", "윤락", "음경", "음독", "음란", "음모", "음부",
		"음욕", "음탕", "일베충", "자G", "자gy", "자ji", "자jy", "자zi", "자zy", "자슬아치", "자위", "자쥐", "자지", "잠G", "잠gy", "잠ji", "잠jy", "잠zi", "잠zy", "잠쥐", "잠지", "전땅크",
		"전라디언", "전라민국", "전립선", "전화방", "정력제", "정액", "젖꼭지", "젖탱", "조또", "존나", "좀물", "좃같", "좃같", "좃까", "좃꼴", "좃나", "좃물", "좃빠", "좆까", "좆꼴",
		"좆나", "좆물", "좆빠", "좇같", "좇까", "좇꼴", "좇나", "좇빠", "중력절", "쥐박이", "즐딸", "지랄", "질속", "짬지", "쩔뚜기", "쩔뚝이", "쪼가리", "창년", "청산가", "체위", "최음제",
		"츄미", "카드깡", "코카인", "콘돔", "통들", "툰운영자", "팁토", "패니스", "패륜", "패티쉬", "패티시", "팬t", "팬ti", "팬티", "팰라치오", "팸섭", "퍼르노", "페티쉬", "페티시",
		"펜t", "펜ti", "펜티", "펠라티오", "펨돔", "포루노", "포르노", "포른노", "폭동", "폰색", "폰섹", "폰쌕", "폰쎅", "폰팅", "하비욧", "해킹", "핵대중", "핵펭귄", "호스테스",
		"호스트바", "호스트빠", "혼음", "홍들", "화냥년", "화상채팅", "화양년", "후배위", "흥분제", "히로뽕", "밍키넷", "http", "최훈", "이말년", "박또", "여시현", "정보근",
		"전승욱", "현이씨", "주호민", "와담지행", "란게", "로박트네길", "채준", "버내노", "이한솔", "엠끼당", "만취", "명랑", "불개미", "심윤수", "하마", "김인호", "강풀", "양영순",
		"신얼", "이동욱", "두순", "유비", "정대삼", "황상준", "달고나", "윤태호", "후렛샤", "갤부", "김보통", "배낭자", "이도고", "귤소녀", "장마로 ", "모히또모히칸", "이지우", "이노안",
		"김필주", "큰빛", "정종택", "이삼희", "시화", "이피로", "김진욱", "메이롱", "워커", "임연택", "양백", "이현도", "은유", "승정연", "게코", "이힝", "쿨싴", "정대롱", "홍희", "정회주", "울동맑",
		"하율이아부지", "김균태", "고민중", "수사반장", "김학영", "해밀", "띠웅", "맛", "모히또모히칸", "하율이아부지", "최규석", "하대리 ", "이말년4컷특급", "병맛극장", "렘브란트블러드",
		"카모플라쥬", "즐거우리우리네인생", "셋이서쑥", "저놈주택생활기", "하늘아래우체부", "배드갓블러드펀치", "개천고", "괜찮아yo", "무지개의끝엔", "창문밖에싱아",
		"냄새를보는소녀", "신들린방망이", "그녀는무사다", "짧은괴담그을음", "붉은여우", "지랄발광", "일쌍다반사", "천일야화", "다정종합병원", "그마을의히어로", "수상한그녀의밥상", 
		"앙쌍블", "코난김전일", "달고나일기", "수상한아이들", "마법사", "아만자", "제주날라리배낭자", "사이렌", "샌드위치를먹다", "팬피터", "썸툰시즌1", "썸툰시즌2", "로딩",
		"진주", "영감놀이", "호야", "족구하고있네!", "냠냠이", "푸른바람척준경", "변신!후뿌뿝☆", "어둠의속도", "파리대왕", "마카", "생선이왔어요", "하루달콤하루쌉싸름",
		"당신의하우스헬퍼", "커피와스무디", "마마", "악마도의무교육받습니다", "인생은대롱대롱", "리얼하우스", "고삼무쌍", "우리동네맑음", "딸내미내미툰", "무던한방향", "살인마VS이웃",
		"데빌카운터", "카멜레온", "보통의우리집", "AMANZA ", "수그밥", "저택기", "악의받", "하달하쌉", "냄보소", "즐우우", "개천고등학교", "헤어진다음날", "습지생태보고서",
		"몽쥬페", "이동욱작가", "필작가", "232comix", "씨네진", "대롱대롱 ", "꿀룩이", "TOON", "APPLAY", "YOYOZINE", "PREMIUM", "SHOP", "툰", "앱플레이",
		"요요진", "프리미엄", "숍", "샵", "APLAY", "APPPLAY", "APPLAY", "앱플레이", "오늘의웹툰", "실시간댓글전쟁중", "요일별웹툰", "오늘의웹툰", "프리미엄관", "kt",
		"kth", "대마", "베리", "성기", "성방", "스카이t쇼핑", "암살", "야한", "야한거", "야한것", "야한놈", "야한동영상", "양년", "어드민", "항문", "에로", "에로배우",
		"에로비디오", "에로쇼", "엘리자베스", "올레", "올레마켓웹툰", "니미", "케이티", "케이티하이텔", "황창규", "게이",
		"겔부", "장마로", "이힝", "하율이 아부지", "남지은", "이설", "염소군", "만화인간", "나와", "홍필", "WALCOMIC", "광운", "진원", "이지현", "피온", "한기남", "KEVIN HAN", "REDICE-K", "안의영", 
		"송동근", "김마리", "안병건", "S리아", "까를로스", "이재진", "재현", "다영", "유형석", "해인", "양혜석", "슈토", "서영민", "수신지", "김대일", "콩자", "PIPO", "라코", "하대리", "이말년 4컷특급", 
		"렘브란트 블러드", "즐거우리 우리네 인생", "셋이서 쑥", "저놈 주택 생활기", "하늘아래 우체부", "배드 갓 블러드 펀치", "무지개의 끝엔", "창문 밖에 싱아", "냄새를 보는 소녀", "신들린 방망이", "그녀는 무사다", 
		"짧은 괴담 그을음", "붉은 여우", "그 마을의 히어로", "수상한 그녀의 밥상", "코난 김전일", "달고나 일기", "수상한 아이들", "제주 날라리 배낭자", "샌드위치를 먹다", "썸툰 시즌1", "썸툰 시즌2", "영감놀이", 
		"족구하고 있네!", "푸른바람 척준경", "변신! 후뿌뿝☆", "어둠의 속도", "생선이 왔어요", "하루달콤 하루쌉싸름", "당신의 하우스헬퍼 시즌1", "커피와 스무디", "마마", "악마도 의무교육 받습니다", "인생은 대롱대롱", 
		"무던한 방향", "보통의 우리집", "당신의 하우스헬퍼 시즌2", "헤어진 다음날", "킹스블러드", "안드로메이트", "은빛고릴라", "청춘거지클럽", "삼각김밥을 까는 법", "버니 로즈", "헤어스탕스", "킬러라인", "펜션 타나토스", 
		"신비의 가면", "바람소리", "영화마왕 부하되기", "영광의 교실", "돌아갈 귀", "드링커스하이", "드림 판타지", "모범택시", "9레벨의 열람요원", "오리스 오리엔타", "그것에 대하여", "왕자님이 있다", "욕구불만일기", 
		"스트리트 페인터", "공포단편선X", "창문 밖에 싱아 시즌2", "EVE", "DOOMSDAY CITY", "말하기엔 사소한", "운영자", "관리자", "운영진", "운영팀"
	};
	
	protected static String[] COMMENT_CONTAIN_SPAM_WORDS = {
		"1090tv", "10jil", "18tv", "18x", "4kkasi", "99bb", "ama10", "asiangirl", "Avmania", "AV매니아", "AV배우", "bbagoori", "bbagury", "bdsm", "beheading", 
		"boG", "bogy", "boji", "bojy", "bozi", "bozy", "bo지", "bo지", "bubunara", "bunsec", "bunsek", "byuntae", "byuntae", "c2joy", "c8", "condom", 
		"c발", "c발", "c벨", "c퐐", "dhakeka", "diehd", "dildo", "dnjswhrywp", "ecstasy", "femdom", "fetish", "fuck", "gangbang", "gocinepia", "g-spot", 
		"g스팟", "hentai", "hotsex", "jaG", "jagy", "jaji", "jajy", "jamG", "jamgy", "jamji", "jamjy", "jamzi", "jamzy", "jam지", "jazi", "jazy", "ja지", 
		"kgirls", "MC무현", "molca", "nude", "ogrish", "oral", "penis", "penthouse", "petish", "ponsec", "ponsek", "porn", "porner", "porno", "prno", "qkenrdl", 
		"rotten", "sex", "sora", "suck", "swaping", "tprtm", "yadong", "yasa", "yasul", "zaG", "zagy", "zaji", "zajy", "zamG", "zamgy", "zamjy", "zamzi", 
		"zamzy", "zam쥐", "zazi", "zazy", "za지", "zotto", "가슴구경", "가슴나오", "가슴노모", "가슴빠", "가슴빨", "가슴주물럭", "가슴짱", "가슴큰", "가슴훔","가정교사미키", "간철수", 
		"갈보", "강간", "개간녀", "개년", "거유", "겁탈", "고추만", "고추짱", "과부촌", "귀두", "그룹섹", "근친", "까보전", "꼬추", "꼴려", "꼴림", "난교", "다방레지", "대딸", "대마초", 
		"대줄년", "대줄뇬", "대출", "대포차", "대포통장", "대포폰", "도요타다이쥬", "도요타다이쥬", "돌림빵", "동물섹", "뒤치기", "뒷치기", "딜도", "딸달이", "딸따뤼", "딸따리", "딸딸2", 
		"딸딸이", "떡걸", "떡치기", "떼십", "또라이", "러브젤", "러브호텔", "레비트라", "마스터배이션",
		"매춘", "몸챗", "몸캠", "무료성인", "문죄인", "물뽕", "미시촌", "미씨촌", "바이브레이터", "발기", "방석집", "버짓물", "번색", "번섹", "번쌕", "벙섹", "변섹", "병신", "보G", "보gy", "보jy",
		"보z", "보zi", "보zy", "보꾸기", "보도방", "보빨", "보슬아치", "보쥐", "보지", "보질리아", "보짓", "보짖", "보테크", "봉지털", "부가케", "불알", "붕가", "븅신", "비아그라", "빙신",
		"빠걸", "빠구", "빠굴", "빠꾸리", "빠순이", "빡우리", "빡울", "빡촌", "빨간마후라", "빨통", "뻐르너", "뻐르노", "뻐킹", "뽀로노", "뽀르노", "뽀지", "뽈노", "뽈로노", "사까쉬", "사까시",
		"사까치", "사창가", "사카시", "삿깟시", "새꺄", "색수", "색쉬", "색스", "색쓰", "색폰", "색휘", "성감대", "성관계", "성교", "성기구", "성드립", "성매매", "세꺄", "세엑스", "섹s", "섹걸",
		"섹골", "섹녀", "섹도리", "섹도우즈", "섹마", "섹소녀", "섹소리", "섹수", "섹순", "섹스", "섹쑤", "섹쓰", "섹잘하는", "섹티즌", "섹파", "섹하고", "섹할", "섹휘", "소라가이드", "소라넷",
		"소라의가이드", "수간", "수꼴", "수음", "쉑스", "스리섬", "스리썸", "스아핑", "스와핑", "스왑", "스팽킹", "슨상님", "슨탄절", "슴가", "십jil", "쌕걸", "쌕녀", "쌕쉬", "쌕스", "쌕시",
		"쌕쓰", "쎄엑스", "쎅", "쓰리섬", "쓰리썸", "씨bal", "씨바", "씨발", "씨알리스", "안마시술", "애액", "애인교환", "애인대여", "애인대행", "애인방", "애인브레이져", "애인알바",
		"야게임", "야겜", "야근병동", "야께임", "야껨", "야덩", "엑스타스", "엑스터시", "엑스터시", "오그리쉬", "오그리시", "오랄", "오럴", "오입", "용주골", "유두", "육구자세", "윤간", "윤락",
		"음부", "자G", "자gy", "자ji", "자jy", "자zi", "자zy", "자위", "자쥐", "자지", "잠G", "잠gy", "잠ji", "잠jy", "잠zi", "잠zy", "잠쥐", "잠지", "전립선", "전화방", "정력제",
		"젖꼭지", "젖탱", "조또", "존나", "좀물", "좃같", "좃같", "좃까", "좃꼴", "좃나", "좃물", "좃빠", "좆까", "좆꼴", "좆나", "좆물", "좆빠", "좇같", "좇까", "좇꼴", "좇나", "좇빠", "체위", "콘돔",
		"패니스", "패티쉬", "패티시", "팬t", "팬ti", "팰라치오", "팸섭", "퍼르노", "페티쉬", "페티시", "펜t", "펜ti", "펜티", "펠라티오", "펨돔", "포루노", "포르노", "포른노", "폰색",
		"폰섹", "폰쌕", "폰쎅", "폰팅", "화냥년", "화양년", "후배위", "흥분제", "히로뽕", "밍키넷", "http", "성기", "성방", "스카이t쇼핑", "야한동영상", "양년", "에로비디오", "에로쇼", "니미"
	};
	
//	protected static String[] WEBTOON_INFO_SPAM_WORDS = {
//		"최훈", "이말년", "박또", "여시현", "정보근", "전승욱", "현이씨", "주호민", "와담지행", "란게", "로박트네길", "채준", "버내노", "이한솔", "엠끼당", "만취", "명랑", "불개미", "심윤수", "하마",
//		"김인호", "강풀", "양영순", "신얼", "이동욱", "두순", "유비", "정대삼", "황상준", "달고나", "윤태호", "후렛샤", "겔부", "김보통", "배낭자", "이도고", "귤소녀", "장마로", "모히또모히칸", 
//		"이지우", "이노안", "김필주", "큰빛", "정종택", "이삼희", "시화", "이피로", "김진욱", "메이롱", "워커", "임연택", "양백", "이현도", "은유", "승정연", "게코", "이힝", "쿨싴", "정대롱", 
//		"홍희", "정회주", "울동맑", "하율이 아부지", "김균태", "고민중", "수사반장", "김학영", "해밀", "띠웅", "맛", "최규석", "남지은", "이설", "염소군", "만화인간", "나와", "홍필", "WALCOMIC", 
//		"광운", "진원", "이지현", "피온", "한기남", "KEVIN HAN", "REDICE-K", "안의영", "송동근", "김마리", "안병건", "S리아", "까를로스", "이재진", "재현", "다영", "유형석", "해인", "양혜석", 
//		"슈토", "서영민", "수신지", "김대일", "콩자", "PIPO", "라코", "하대리", "이말년 4컷특급", "병맛극장", "렘브란트 블러드", "카모플라쥬", "즐거우리 우리네 인생", "셋이서 쑥", "저놈 주택 생활기", 
//		"하늘아래 우체부", "배드 갓 블러드 펀치", "개천고", "괜찮아yo", "무지개의 끝엔", "창문 밖에 싱아", "냄새를 보는 소녀", "신들린 방망이", "그녀는 무사다", "짧은 괴담 그을음", "붉은 여우", "지랄발광", 
//		"일쌍다반사", "천일야화", "다정종합병원", "그 마을의 히어로", "수상한 그녀의 밥상", "앙쌍블", "코난 김전일", "달고나 일기", "수상한 아이들", "마법사", "아만자", "제주 날라리 배낭자", "사이렌", "샌드위치를 먹다", 
//		"팬피터", "썸툰 시즌1", "썸툰 시즌2", "로딩", "진주", "영감놀이", "호야", "족구하고 있네!", "냠냠이", "푸른바람 척준경", "변신! 후뿌뿝☆", "어둠의 속도", "파리대왕", "마카", "생선이 왔어요", "하루달콤 하루쌉싸름", 
//		"당신의 하우스헬퍼 시즌1", "커피와 스무디", "마마", "악마도 의무교육 받습니다", "인생은 대롱대롱", "리얼하우스", "고삼무쌍", "우리동네맑음", "딸내미내미툰", "무던한 방향", "살인마VS이웃", "데빌카운터", "카멜레온", 
//		"보통의 우리집", "당신의 하우스헬퍼 시즌2", "습지생태보고서", "헤어진 다음날", "몽쥬페", "킹스블러드", "안드로메이트", "은빛고릴라", "청춘거지클럽", "삼각김밥을 까는 법", "버니 로즈", "헤어스탕스", "킬러라인", 
//		"펜션 타나토스", "신비의 가면", "바람소리", "영화마왕 부하되기", "영광의 교실", "돌아갈 귀", "드링커스하이", "드림 판타지", "모범택시", "9레벨의 열람요원", "오리스 오리엔타", "그것에 대하여", "왕자님이 있다", 
//		"욕구불만일기", "스트리트 페인터", "공포단편선X", "창문 밖에 싱아 시즌2", "EVE", "DOOMSDAY CITY", "말하기엔 사소한"
//	};

	/**
     * 댓글 금칙어 포함 여부
     * @param String src : 체크할 문자열
     * @return String   : 금칙어
     */
    public static String isCommentContain(String src) {
    	
    	for(int i=0 ; i < COMMENT_CONTAIN_SPAM_WORDS.length ; i++){
    		if((src.toUpperCase()).indexOf(COMMENT_CONTAIN_SPAM_WORDS[i].toUpperCase()) > -1){
    			return COMMENT_CONTAIN_SPAM_WORDS[i];
    		}
    	}
    	
    	return null;
    }
    
	/**
     * 금칙어 포함 여부
     * @param String src : 체크할 문자열
     * @return String   : 금칙어
     */
    public static String isContain(String src) {
    	
    	for(int i=0 ; i < CONTAIN_SPAM_WORDS.length ; i++){
    		if((src.toUpperCase()).indexOf(CONTAIN_SPAM_WORDS[i].toUpperCase()) > -1){
    			return CONTAIN_SPAM_WORDS[i];
    		}
    	}
    	
    	return null;
    }
    
//	/**
//     * 금칙어 일치 여부
//     * @param String src : 체크할 문자열
//     * @return String   : 금칙어
//     */
//    public static String isEqual(String src) {
//    	for(int i=0 ; i < EQUAL_SPAM_WORDS.length ; i++){
//    		if((EQUAL_SPAM_WORDS[i].toUpperCase()).equals(src.toUpperCase())){
//    			return EQUAL_SPAM_WORDS[i];
//    		}
//    	}
//    	return null;
//    }
}